/*
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
struct teacher {
	char name[10];
	int id;
	double salary;
};
struct student {
	char name[10];
	int id;
	float score;
}stu[10];
struct school {
	char name[20];
	struct teacher T;
	struct student S;
};

int main(){
	
	//二进制与原反补码
	// <<左移  >>右移
	// &与 |或 ^异或 ~取反
	// ( ..., ..., ... )逗号表达式
	// 数组名[ ]下标引用
	// 函数名( )函数调用
	// .结构成员访问

	//仅用异或实现两个变量的数值交换
	int a = 0;
	int b = 0;
	scanf("%d %d", &a, &b);
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("a=%d b=%d\n", a, b);

	int m = 0, count = 0;
	scanf("%d", &m);
	while (m) {
		m = m & (m - 1);
		count++;
	}
	printf("%d\n", count);
	
	int m1 = 0, n1 = 0;
	scanf("%d %d", &m1,&n1);
	m1 = m1 | 1 << n1 - 1;
	printf("%d\n", m1);
	m1 = m1 & ~(1 << n1 - 1);
	printf("%d\n", m1);
	
	int a1 = 1, b1 = 2;
	int c1 = (a1 > b1, a1 = b1 + 10, b1 = a1 + 10);
	//逗号表达式从左到右执行语句，表达式的最终结果由最后一个表达式决定
	printf("%d\n", c1);
	
	struct teacher t = { "wxd",1,3000.0 };//按顺序全部赋值
	struct student stu = { .name = "qyh",.score = 82.5f };//指定初始化器，可不按顺序赋值
	struct school s = { "hnrw",{"wxd",1,3000.0 },{"qyh",7,82.5f} };
	printf("%s %d %.2f", stu.name, stu.id, stu.score);
	//利用.访问结构体成员，对于没有赋值的成员变量全部初始化为0
	
	// 所有操作符的优先级：
	// 1.后置++或-- /函数调用() /下标引用[] /结构成员访问.
	// 2.前置++或-- /符号态+或- /! /~ /强制类型转换() /取地址& /解引用* /sizeof	结合性从右向左
	// 3.* / / / %
	// 4.+ / -
	// 5.<< / >>
	// 6.< / <= / > / >=
	// 7.== / !=
	// 8—13. & > ^ > | > && > || > ?:	?:三目运算符的结合性从右向左
	// 14.= / *= / /= / += / -= / <<= / >>= / &= / ^= / |=	结合性从右向左
	// 15. ,
	
	char x = 20;
	//00000000000000000000000000010100 ——20以int类型赋给char类型的x
	//00010100 ——x作为char类型，一字节只能装八位，发生数据截断
	char y = 110;
	//00000000000000000000000001101110 ——110以int类型赋给char类型的y
	//01101110 ——y作为char类型，一字节只能装八位，发生数据截断
	char z = 0;
	z = x + y;
	//	00000000000000000000000000010100 ——按照int类型参与运算，整型提升，按最高位的符号位填充
	//+	00000000000000000000000001101110 ——按照int类型参与运算，整型提升，按最高位的符号位填充
	//=	00000000000000000000000010000010 ——在int类型下的运算结果
	printf("%d\n", z);
	//10000010 ——z作为char类型，一字节只能装八位，发生数据截断
	//11111111111111111111111110000010 ——%d按照int类型输出，整型提升，按最高位的符号位填充
	//10000000000000000000000001111110 ——补码转原码，-126
	
	// 算术转换：如果操作符的操作数属于不同类型，运算前需要转成相同类型
	// int --> unsigned int --> long --> unsigned long --> float --> double --> long double
	int a1 = 1, a2 = 2, a3 = 3, a4 = 4, a5 = 5, a6 = 6;
	printf("%d\n", a1 * a2 + a3 * a4 + a5 * a6);
	printf("%d\n", a1+ --a1);
	a2 = a2-- - --a2 * a2++ + ++a2;
	printf("%d\n", a2);
	//即使通过操作符的优先级与结合性可以知道正常表达式的运算顺序，但也不建议写太过复杂的表达式，可能会导致意料外的结果

	return 0;
}
*/